vlm/base/DataProcessors/бит_ГрупповоеИзменениеПризнаковНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ГрупповоеИзменениеПризнаковНоменклатуры</Name>
			<Comment>ЛТ5.33</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПризнаков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Признак</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ПризнакиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПризнака</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ДополнительныеПризнакиНоменклатуры</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакСертификации</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

vlm/base/InformationRegisters/бит_ЗначенияПризнаковНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначенияПризнаковНоменклатуры</Name>
			<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>бит_Значение</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ПризнакиНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>бит_Номенклатура</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_Признак</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ПризнакиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_ПризнакСертификации</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/DataProcessors/бит_ГрупповоеИзменениеПризнаковНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОчиститьТаблицуНоменклатуры(Команда)
	Объект.ТаблицаНоменклатуры.Очистить();
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуПризнаков(Команда)
	Объект.ТаблицаПризнаков.Очистить(); 
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурыПриИзменении(Элемент)
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПризнаковПриИзменении(Элемент)
	Модифицированность = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьОкно(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПризнаки(Команда)
	
	СтруктураПараметров = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьПризнакиЗавершение", ЭтотОбъект, СтруктураПараметров); 
	ПоказатьВопрос(ОписаниеОповещения, "Записать признаки ноенклатуры?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьПризнакиЗавершение(РезультатВопроса, СтруктураПараметров) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Если НоменклатураЗаполненаИЗначенияУстановлены() Тогда
			ЗаписатьПризнакиНаСервере();	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	                

&НаКлиенте
Функция  НоменклатураЗаполненаИЗначенияУстановлены()

	МожноЗаписыватьПризнаки = Истина;
	
	Для Каждого СтрокаНоменклатуры Из Объект.ТаблицаНоменклатуры Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура) Тогда
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Поле = "Объект.ТаблицаНоменклатуры" + "[" + Формат(Число(СтрокаНоменклатуры.НомерСтроки - 1), "ЧГ=0") + "].Номенклатура"; 
			СообщениеПользователю.Текст = "В строке " + СтрокаНоменклатуры.НомерСтроки + " не заполнена номенклатура!";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			
			МожноЗаписыватьПризнаки = Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаПризнак Из Объект.ТаблицаПризнаков Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаПризнак.Признак) Тогда
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Поле = "Объект.ТаблицаПризнаков" + "[" + Формат(Число(СтрокаПризнак.НомерСтроки - 1), "ЧГ=0") + "].Признак"; 
			СообщениеПользователю.Текст = "В строке " + СтрокаПризнак.НомерСтроки + " не заполнен признак!";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			
			МожноЗаписыватьПризнаки = Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаПризнак Из Объект.ТаблицаПризнаков Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаПризнак.ЗначениеПризнака) Тогда
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Поле = "Объект.ТаблицаПризнаков" + "[" + Формат(Число(СтрокаПризнак.НомерСтроки - 1), "ЧГ=0") + "].ЗначениеПризнака"; 
			СообщениеПользователю.Текст = "В строке " + СтрокаПризнак.НомерСтроки + " не заполнено значение признака!";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			
			МожноЗаписыватьПризнаки = Ложь;
			
		КонецЕсли;
	КонецЦикла;

	
	Возврат МожноЗаписыватьПризнаки;

КонецФункции

&НаСервере
Процедура ЗаписатьПризнакиНаСервере()    

	Для Каждого СтрокаНоменклатуры Из Объект.ТаблицаНоменклатуры Цикл
		Для Каждого СтрокаПризнак Из Объект.ТаблицаПризнаков Цикл
			
			ЗаписьРегистра = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.бит_Номенклатура = СтрокаНоменклатуры.Номенклатура;
			ЗаписьРегистра.бит_Признак = СтрокаПризнак.Признак;
			ЗаписьРегистра.бит_ПризнакСертификации = СтрокаПризнак.Признак.бит_ПризнакСертификации;
			ЗаписьРегистра.бит_Значение = СтрокаПризнак.ЗначениеПризнака;
			ЗаписьРегистра.Записать(Истина);
			
		КонецЦикла;
	КонецЦикла;
	
	Сообщить("Запись признаков завершена!");
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборТаблицаНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",	
		Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор", Ложь, Истина, Истина),
		ЭтаФорма, , , , ,
		//Новый ОписаниеОповещения("ПриЗакрытииФормыПодбора",	ЭтаФорма,"Подбор"),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПодборТаблицаПризнаков(Команда)
	
	ОткрытьФорму("ПланВидовХарактеристик.бит_ПризнакиНоменклатуры.ФормаВыбора",	
		Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор", Ложь, Истина, Истина),
		ЭтаФорма, , , , ,
		//Новый ОписаниеОповещения("ПриЗакрытииФормыПодбора",	ЭтаФорма,"Подбор"),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаВыбораГруппИЭлементов" Тогда
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
				
				Для Каждого ЭлМассива Из ВыбранноеЗначение Цикл
									
					//Если НЕ ЭлМассива.ЭтоГруппа Тогда
						
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("Номенклатура", ЭлМассива);
						
						Если Объект.ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
							НоваяСтрока = Объект.ТаблицаНоменклатуры.Добавить();
							НоваяСтрока.Номенклатура = ЭлМассива;
						КонецЕсли;
						
					//КонецЕсли;
					
				КонецЦикла;	
				
			Иначе
								
				//Если НЕ ВыбранноеЗначение.ЭтоГруппа Тогда
					
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Номенклатура", ВыбранноеЗначение);
					
					Если Объект.ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
						НоваяСтрока = Объект.ТаблицаНоменклатуры.Добавить();
						НоваяСтрока.Номенклатура = ВыбранноеЗначение;
					КонецЕсли;
					
				//КонецЕсли;
				
			КонецЕсли;
	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИсточникВыбора.ИмяФормы = "ПланВидовХарактеристик.бит_ПризнакиНоменклатуры.ФормаВыбора" Тогда
	
		Если ВыбранноеЗначение <> Неопределено Тогда
			
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
				
				Для Каждого ЭлМассива Из ВыбранноеЗначение Цикл
					
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Признак", ЭлМассива);
					
					Если Объект.ТаблицаПризнаков.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
						НоваяСтрока = Объект.ТаблицаПризнаков.Добавить();
						НоваяСтрока.Признак = ЭлМассива;
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе	
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Признак", ВыбранноеЗначение);
				
				Если Объект.ТаблицаПризнаков.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
					НоваяСтрока = Объект.ТаблицаПризнаков.Добавить();
					НоваяСтрока.Признак = ВыбранноеЗначение;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры


&НаСервере
Процедура ТаблицаПризнаковПризнакПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаПризнаковПризнакПриИзменении(Элемент)
	ТаблицаПризнаковПризнакПриИзмененииНаСервере();
КонецПроцедуры
